Repository: AdrienClairembault/doc-install
Catalog: source/locale/*/LC_MESSAGES/install/wizard.po
Languages: cs_cz

source: Install wizard
cs_cz: Průvodce instalací

source: To begin installation process, point your browser to the GLPI main address: `https://{adresse_glpi}/ <https://{adresse_glpi}/>`_
cs_cz: Pro zahájení instalace, nasměrujte svůj webový prohlížeč na hlavní adresu GLPI: `https://{adresse_glpi}/ <https://{adresse_glpi}/>`_

source: When GLPI is not installed; a step-by-step installation process begins.
cs_cz: Pokud GLPI ještě není nainstalováno; jsou zahájeny jednotlivé kroky instalačního procesu.

source: Choose lang (Select your language)
cs_cz: Zvolte jazyk (vyberte svůj jazyk)

source: The first step will let you choose the installation language. Select your lang, and click validate.
cs_cz: Prvním krokem je volba jazyka instalace. Vyberte svůj jazyk a potvrďte.

source: License
cs_cz: Licence

source: Usage of GLPI is subject to GNU license approval. Once licensing terms read and accepted, just validate the form.
cs_cz: Používání GLPI vyžaduje souhlas s licencí GNU GPL (zaručuje svobody). Po přečtení a souhlasu s licenčními podmínkami potvrďte.

source: If you do not agree with licensing terms, it is not possible to continue installation process.
cs_cz: Pokud nesouhlasíte s podmínkami licence, není možné pokračovat v instalaci.

source: Install / Update
cs_cz: Instalace/aktualizace

source: This screen allows to choose between a fresh GLPI installation or an update.
cs_cz: Tato obrazovka umožňuje zvolit mezi novou instalací GLPI a aktualizací.

source: Click on install.
cs_cz: Klikněte na instalaci.

source: Environment checks
cs_cz: Kontroly prostředí

source: This step will check if prerequisites are met. If thery're not, it is not possible to continue and an explicit error message will tell you about what is wrong and what to do before trying again.
cs_cz: V tomto kroku je zkontrolováno splnění technických náležitostí. Pokud neúspěšně, není možné pokračovat a výslovné chybové hlášení informuje o tom, co je třeba napravit než bude možné zkusit znovu.

source: Some prerequisites are optionals, it will be possible to continue installation event if thery're not met.
cs_cz: Některé náležitosti jsou volitelné, v instalaci bude možné pokračovat i když nejsou splněné.

source: Database connection
cs_cz: Připojení do databáze

source: Database connection parameters are asked.
cs_cz: Jsou vyžádány parametry pro připojení do databáze.

source: *MySQL server*: enter the path to your MySQL server, `localhost` or `mysql.domaine.tld` as example;
cs_cz: *MySQL server*: zadejte popis umístění svého MySQL serveru, například `localhost` nebo `mysql.domenovynazev.tld`;

source: *MySQL user*: enter user name that is allowed to connect to the Database;
cs_cz: *MySQL uživatel*: zadejte uživatelské jméno účtu, který je oprávněn se připojovat do databáze;

source: *MySQL password*: enter user's password.
cs_cz: *MySQL heslo*: zadejte heslo uživatele.

source: Once all fields are properly filled, validate the form.
cs_cz: Jakmile jsou všechny kolonky řádně vyplněné, potvrďte formulář.

source: A first database connection is then established. If parameters are invalid, an error message will be displayed, and you'll have to fix parameters and try again.
cs_cz: Poté je navázáno první spojení do databáze. Pokud parametry nejsou platné, zobrazí se chybové hlášení a bude třeba parametry opravit – a pak vyzkoušet znovu.

source: Database choice
cs_cz: Volba databáze

source: Once connection to the database server is OK, you have to create or choose the database you want for your GLPI and init it.
cs_cz: Jakmile je spojení s databázovým serverem v pořádku, je třeba vytvořit nebo zvolit databázi, kterou chcete použít pro GLPI a inicializovat ji.

source: There are 2 ways to go:
cs_cz: Jsou dva způsoby jak pokračovat:

source: use an existing database
cs_cz: použít existující databázi

source: Select this database in the displayed list. Validate to use.
cs_cz: Vyberte tuto databázi ze zobrazeného seznamu. Potvrďte a použijte.

source: Selected database contents will be destroyed on installation.
cs_cz: Při instalaci bude jakýkoli případný obsah vybrané databáze zlikvidován.

source: Create a new database
cs_cz: Vytvořit novou

source: Choose *Create a new database*, enter the database name in the relevant field and then validate to create the base.
cs_cz: Zvolte *Vytvořit novou databázi*, zadejte název pro ní do odpovídající kolonky a potvrďte.

source: SQL user must be able to create new database for this option to work.
cs_cz: Aby tato volba fungovala je třeba, aby daný SQL uživatel měl práva na vytváření nových databází.

source: Database initialization
cs_cz: Inicializace databáze

source: This step initializes the database with default values.
cs_cz: Tento krok inicializuje databázi s výchozími hodnotami.

source: If there is any error; pay attention to the displayed informations.
cs_cz: V případě jakékoli chyby; věnujte pozornost zobrazeným informacím.

source: Telemetry informations
cs_cz: Telemetrické informace

source: GLPI will ask you to share some Telemetry informations and to register. This is not mandatory.
cs_cz: GLPI vás požádá o sdílení některých telemetrických údajů a registraci. Ani jedno není povinné.

source: End of installation
cs_cz: Konec instalace

source: This step presents a summary of the installation and give created users list. Please pay attention to those informations and validate to go to the app.
cs_cz: Tento krok představuje souhrn instalace a poskytuje seznam vytvořených uživatelů. Věnujte těmto informacím pozornost a jeho potvrzením přejděte do aplikace.

source: Default user accounts are:
cs_cz: Výchozí uživatelské účty jsou:

source: *glpi/glpi* admin account,
cs_cz: *glpi/glpi* účet správce,

source: *tech/tech* technical account,
cs_cz: *tech/tech* účet technika,

source: *normal/normal* "normal" account,
cs_cz: *normal/normal* účet běžného uživatele,

source: *post-only/postonly* post-only account.
cs_cz: *post-only/postonly* účet pouze pro posílání.

source: For obvious security concerns, you'll have to delete or edit those accounts.
cs_cz: Ze zřejmých bezpečnostních důvodů byste měli tyto účty změnit (heslo) nebo smazat.
