Repository: AdrienClairembault/doc-install
Catalog: source/locale/*/LC_MESSAGES/command-line.po
Languages: cs_cz, de_de, es_419, pt_br, zh_cn

source: Command line tools
cs_cz: Nástroje pro příkazový řádek
de_de: Kommandozeilen-Tools
es_419: Herramientas de linea de comando
pt_br: Ferramentas de linha de comando
zh_cn: 命令行工具

source: Since GLPI 9.2.2, command line tools are provided as supported scripts and are available from the ``scripts`` directory of the archive. On previous versions, those scripts were present in the ``tools`` directory that is not official and therefore not in the release archive.
cs_cz: Od GLPI verze 9.2.2 jsou nástroje pro příkazový řádek poskytovány jako podporované skripty a jsou k dispozici ve složce ``scripts`` (skripty) v archivu. V předchozích verzích se tyto skripty nacházely ve složce ``tools`` (nástroje) která není oficiální a proto není přítomná v instalačním archivu vydání.
de_de: Seit GLPI 9.2.2 werden Kommandozeilen-Tools als unterstützende Skripte bereitgestellt und sind im Verzeichnis ``scripts`` des Archivs verfügbar. In früheren Versionen waren diese Skripte im Verzeichnis ``tools```, welches nicht offiziell ist und daher nicht im Release-Archiv vorhanden ist.
es_419: Desde GLPI 9.2.2, las herramientas de línea de comandos se proporcionan como scripts compatibles y están disponibles en el directorio `` scripts`` del archivo. En versiones anteriores, esos scripts estaban presentes en el directorio `` tools`` que no es oficial y, por lo tanto, no está en el archivo de la versión.
pt_br: Desde o GLPI 9.2.2, as ferramentas de linha de comando são fornecidas como scripts suportados e estão disponíveis no diretório `` scripts`` do arquivo. Nas versões anteriores, esses scripts estavam presentes no diretório `` tools`` que não era oficial e, portanto, não estão no arquivo de lançamento.
zh_cn: 在GLPI9.2.2版本之前，命令行工具属于非官方但受支持的脚本来提供其可在``scripts``目录中找到。因不属于官方，故不再发布归档。

source: If APCu is installed on your system, it may fail from command line since default configuration disables it from command-line. To change that, set ``apc.enable_cli`` to ``on`` in your APCu configuration file.
cs_cz: Pokud je v systému nainstalované APCu PHP rozšíření, nemusí se podařit ho použít z příkazového řádku, protože ve výchozím nastavení je tato možnost vypnutá. Změnit je to možné nastavením volby ``apc.enable_cli`` na ``on`` v souboru s nastaveními APCu.
de_de: Wenn APCu auf Ihrem System installiert ist, kann es von der Kommandozeile aus fehlschlagen, da die Standardkonfiguration es von der Kommandozeile aus deaktiviert. Um das zu ändern, setzen Sie in Ihrer APCu-Konfigurationsdatei ``apc.enable_cli`` auf ``on```.
es_419: Si APCu está instalado en su sistema, puede fallar desde la línea de comandos ya que la configuración predeterminada lo desactiva de la línea de comandos. Para cambiar eso, establezca `` apc.enable_cli`` a `` on`` en su archivo de configuración APCu.
zh_cn: 假如您系统中已安装了APCu依赖，由于在命令行下默认配置其为禁用状态，因此它可能会在命令行模式下失效。如需要启用，请找到APCu的配置文件中的t ``apc.enable_cli`` 设为 ``on`` 启用。

source: Install
cs_cz: Instalace
de_de: Installation
es_419: Instalar
pt_br: Instalar
zh_cn: 安装

source: A PHP command line installation script is provided in the GLPI archive (``scripts/cliinstall.php``).
cs_cz: V instalačním archivu GLPI je poskytován instalační PHP skript pro příkazový řádek (``scripts/cliinstall.php``).
de_de: Ein PHP-Kommandozeilen-Installationsskript ist im GLPI-Archiv enthalten (``scripts/cliinstall.php``).
es_419: Se proporciona un script de instalación de línea de comandos de PHP en el archivo GLPI (`` scripts / cliinstall.php``).
pt_br: Um script de instalação de linha de comando PHP é fornecido no arquivo GLPI (`` scripts / cliinstall.php``).
zh_cn: GLPI在 (``scripts/cliinstall.php``)提供了一个PHP命令行安装脚本。

source: You have to specify at least a database name and an user:
cs_cz: Je třeba zadat alespoň název databáze a uživatele:
de_de: Sie müssen mindestens einen Datenbanknamen und einen Benutzer angeben:
es_419: Debe especificar al menos un nombre de base de datos y un usuario:
pt_br: Você precisa especificar pelo menos um nome de banco de dados e um usuário:
zh_cn: 您必须至少指定一个数据库名称和一个用户:

source: It is possible to specifiy some variables calling the script:
cs_cz: Při vyvolávání skriptu je možné nastavit několik proměnných:
de_de: Es ist möglich, einige Variablen anzugeben:
es_419: Es posible especificar algunas variables llamando al script:
pt_br: É possível especificar algumas variáveis como argumentos para passar para o script:
zh_cn: 有可能特别的一些变量调用脚本:

source: ``--host`` host name (`localhost` per default),
cs_cz: ``--host`` název stroje (výchozí je tento stroj samotný – `localhost`),
de_de: ``--host`` Hostname (Standard: `localhost`),
es_419: `` --host`` nombre del host (`localhost` por defecto),
pt_br: `` --host`` nome do host (`localhost` por padrão),
zh_cn: ``--host`` 主机名 (默认`localhost` 本机),

source: ``--db`` database name,
cs_cz: ``--db`` název databáze,
de_de: ``--db`` Datenbankname,
es_419: `` --db`` nombre de la base de datos,
pt_br: `` --db`` nome do banco de dados,
zh_cn: ``--db`` 数据库名称,

source: ``--user`` database user name,
cs_cz: ``--user`` uživatelské jméno databázového uživatele,
de_de: ``--user`` Datenbanknutzer,
es_419: `` --user`` nombre de usuario de la base de datos,
pt_br: `` --user`` nome de usuário do banco de dados,
zh_cn: ``--user`` 数据库用户名,

source: ``--pass`` database user's pasword,
cs_cz: ``--pass`` heslo databázového uživatele,
de_de: ``--pass`` Passwort für den Datenbanknutzer,
es_419: `` - - pass`` contraseña del usuario de la base de datos,
pt_br: `` --pass`` senha do usuário do banco de dados,
zh_cn: ``--pass`` 数据库密码,

source: ``--lang`` language code to use (`fr_FR` as example). Will be set to `en_GB` per default,
cs_cz: ``--lang`` kód jazyka který použít (například `cs_CZ`). Pokud není zadáno, bude použit výchozí `en_GB`,
de_de: ``--lang`` Sprachcode (Beispiel `fr_FR`). Wird standardmäßig auf `en_GB` gesetzt,
es_419: Código de idioma `` --lang`` a usar (`fr_FR` como ejemplo). Se establecerá en `en_GB` por defecto,
pt_br: `` --lang`` código de idioma (`fr_FR` como exemplo). Será definido como `en_GB` por padrão,
zh_cn: ``--lang`` 语言代码 (例如`fr_FR` 代表法国). 默认语言为 `en_GB` 英语,

source: ``--tests`` create tests configuration file,
cs_cz: ``--tests`` vytvořit testovací soubor s nastaveními,
de_de: ``--tests`` erstellt eine Testkonfiguration,
es_419: `` --tests`` crear pruebas de archivo de configuración,
pt_br: `` --tests`` cria um arquivo de configuração de testes,
zh_cn: ``--tests`` 创建一个测试配置文件,

source: ``--force`` do not check if GLPI is already installed and drop what would exists,
cs_cz: ``--force`` nekontrolovat zda je GLPI už nainstalované a zahodit to, co by mohlo existovat,
de_de: ``--force`` es wird nicht auf eine vorhandene GLPI-Installation geprüft und alls vorhandene gelöscht,
es_419: ``--force`` no compruebe si GLPI ya está instalado y descarte lo que existiría,
pt_br: `` --force`` não verificar se o GLPI já está instalado e sobrescrever a instalação existente
zh_cn: ``--force`` 参数代表不检查GLPI是否已安装且不删除。

source: ``--help`` displays command help.
cs_cz: ``--help`` zobrazí nápovědu k příkazu.
de_de: ``--help`` Hilfe anzeigen.
es_419: `` --help`` muestra el comando ayuda.
pt_br: `` --help`` mostra a ajuda do comando.
zh_cn: ``--help`` 获取帮助命令或简体中文爱好者请加扣群206239089.

source: Update
cs_cz: Aktualizace
es_419: Actualizar
pt_br: Atualizar
zh_cn: 更新

source: An update script is provided as well (``scripts/cliupdate.php``).
cs_cz: Obdobně je k dispozici také skript pro aktualizaci (``scripts/cliupdate.php``).
de_de: Es existiert ebenfalls ein Update-Skript (``scripts/cliupdate.php``).
es_419: También se proporciona un script de actualización (`` scripts / cliupdate.php``).
pt_br: Um script de atualização também é fornecido (`` scripts / cliupdate.php``).
zh_cn: 更新脚本在 (``scripts/cliupdate.php``)有提供。

source: There is no required arguments, just run the script so it updates your database automatically.
cs_cz: Nejsou vyžadovány žádné povinné argumenty, stačí jen spuštěním skriptu automaticky zaktualizovat databázi.
de_de: Es gibt keine erforderlichen Argumente, führen Sie einfach das Skript aus, damit es Ihre Datenbank automatisch aktualisiert.
es_419: No hay argumentos necesarios, simplemente ejecute el script para que actualice su base de datos automáticamente.
pt_br: Nenhum argumento requerido, basta executar o script para que ele atualize seu banco de dados automaticamente.
zh_cn: 没有必要的参数，只需运行脚本，以便自动更新数据库。

source: Do not forget to backup your database before any update try!
cs_cz: Před jakýmkoli pokusem o aktualizaci nezapomeňte zazálohovat databázi!
de_de: Vergessen Sie nicht, Ihre Datenbank zu sichern, bevor Sie ein Update durchführen!
es_419: ¡No olvide hacer una copia de seguridad de su base de datos antes de cualquier actualización intente!
pt_br: Não se esqueça de efetuar o backup do banco de dados antes de qualquer atualização!
zh_cn: 在进行任何更新尝试之前，别忘记备份数据库备份数据库备份数据库!

source: Possible options for this command are:
cs_cz: Možné volby pro tento příkaz jsou:
de_de: Mögliche Optionen für diesen Befehl sind:
es_419: Las opciones posibles para este comando son:
pt_br: Possíveis opções para este comando são:
zh_cn: 本命令的可能选项是:

source: ``--config-dir`` set configuration file path to use,
cs_cz: ``--config-dir`` zadat popis umístění souboru s nastaveními, který použít
de_de: ``--config-dir`` setzt den Pfad der Konfigurationsdatei,
es_419: `` --config-dir`` establece la ruta de acceso del archivo de configuración,
pt_br: `` --config-dir`` definir o caminho do arquivo de configuração,
zh_cn: ``--config-dir`` 设置配置文件路径使用,

source: ``--force`` force update, usefull when GLPI version does not change (mainly when working on it ;)),
cs_cz: ``--force`` vynutit aktualizaci, užitečné když se verze GLPI nezmění (slouží hlavně pro vývoj aplikace samotné),
de_de: ``--force`` Update erzwingen, nützlich wenn sich die GLPI-Version nicht ändert (hauptsächlich bei der Arbeit daran ;)),
es_419: `` --force`` force update, útil cuando la versión GLPI no cambia (principalmente cuando se trabaja en ella)),
pt_br: `` --force`` forçar a atualização, útil quando a versão GLPI não muda (principalmente quando se trabalha nele)
zh_cn: ``--force`` 强制更新，当GLPI版本没有更改时使用(主要是在处理时 ;)),

source: ``--dev`` required to use a development version. Use it with caution...
cs_cz: ``--dev`` vyžadováno pro použití vývojové verze. Použijte s rozmyslem…
de_de: ```--dev`` benötigt, um eine Entwicklungsversion zu verwenden. Verwenden Sie es mit Vorsicht...
es_419: `` --dev`` requerido para usar una versión de desarrollo. Úsalo con precaución ...
pt_br: `` --dev`` necessário para usar uma versão de desenvolvimento. Use com cuidado ...
zh_cn: ``--dev`` 需要使用开发版本。小心地使用它...
